Feature: AddAnime feature
	Отговаря за добавяне на ново Аниме към базата
	
	Scenario: Добавяне на аниме с валидни данни
		Given потребителя отваря формата за създаване на аниме
		When въвежда заглавие "ТестАниме"
		And въвежда дата на издаване "01-01-2020"
		And въвежда жанр "ТестЖанр"
		And въвежда описание "ТестОписание"
		And натиска бутона за добавяне
		Then вижда съобщение с текст "Успешно добавено аниме!"
		
	Scenario: Добавяне на аниме без заглавие
		Given потребителя отваря формата за създаване на аниме
		When въвежда дата на издаване "01-01-2020"
		And въвежда жанр "ТестЖанр"
		And въвежда описание "ТестОписание"
		And натиска бутона за добавяне
		Then вижда съобщение с текст "Моля добавете заглавие!"
		
	Scenario: Добавяне на аниме без дата на издаване
		Given потребителя отваря формата за създаване на аниме
		When въвежда заглавие "ТестАниме"
		And въвежда жанр "ТестЖанр"
		And въвежда описание "ТестОписание"
		And натиска бутона за добавяне
		Then вижда съобщение с текст "Моля добавете дата на издаване!"
		
	Scenario: Добавяне на аниме без жанр
		Given потребителя отваря формата за създаване на аниме
		When въвежда заглавие "ТестАниме"
		And въвежда дата на издаване "01-01-2020"
		And въвежда описание "ТестОписание"
		And натиска бутона за добавяне
		Then вижда съобщение с текст "Моля добавете жанр!"	
		
	Scenario: Добавяне на аниме без описание
		Given потребителя отваря формата за създаване на аниме
		When въвежда заглавие "ТестАниме"
		And въвежда дата на издаване "01-01-2020"
		And въвежда жанр "ТестЖанр"
		And натиска бутона за добавяне
		Then вижда съобщение с текст "Моля добавете описание!"